Masmiseim36/nxpSDK/boards/twrkm35z75m/bootloader_examples/tower_bootloader/pin_mux.c
/*
 * Copyright 2020 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v7.0
processor: MKM35Z512xxx7
package_id: MKM35Z512VLQ7
mcu_data: ksdk2_0
processor_version: 0.0.2
board: TWR-KM35Z75M
pin_labels:
- {pin_num: '102', pin_signal: LCD_P4/PTF5/SPI1_MISO/I2C1_SCL, label: 'J32[B44]/J23[9]/J25[14]/SPI1_MISO', identifier: MISO}
- {pin_num: '103', pin_signal: LCD_P5/PTF6/LLWU_P3/SPI1_MOSI/I2C1_SDA, label: 'J32[B45]/J23[10]/J25[13]/SPI1_MOSI', identifier: MOSI}
- {pin_num: '100', pin_signal: LCD_P2/PTF3/LLWU_P20/SPI1_PCS0/LPTMR0_ALT2/UART0_RX, label: 'J32[B46]/J23[11]/J25[16]/SPI1_PCS0', identifier: PCS}
- {pin_num: '101', pin_signal: LCD_P3/PTF4/SPI1_SCK/LPTMR0_ALT1/UART0_TX, label: 'J32[B48]/J23[12]/J25[15]/SPI1_SCK', identifier: SCK}
- {pin_num: '7', pin_signal: LCD_P47/PTI7/UART2_TX, label: UART2_TX, identifier: DEBUG_UART_TX;TX}
- {pin_num: '6', pin_signal: LCD_P46/PTI6/UART2_RX, label: UART2_RX, identifier: DEBUG_UART_RX;RX_GPIO_config;RX_GPIO;RX}
- {pin_num: '106', pin_signal: LCD_P53/PTL0/I2C0_SDA, label: 'J25[11]/I2C0_SDA', identifier: SDA}
- {pin_num: '105', pin_signal: LCD_P52/PTK7/I2C0_SCL/XBAR_OUT9, label: 'J25[12]/I2C0_SCL', identifier: SCL}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitBootPin:
- options: {callFromInitBoot: 'false', coreID: core0, enableClock: 'false'}
- pin_list:
  - {pin_num: '64', peripheral: GPIOD, signal: 'GPIO, 1', pin_signal: PTD1/UART1_TX/SPI0_PCS0/XBAR_OUT3/QTMR0_TMR3, direction: INPUT, slew_rate: slow, pull_select: up,
    pull_enable: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPin
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPin(void)
{

    gpio_pin_config_t SW2_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD1 (pin 64)  */
    GPIO_PinInit(BOARD_INITBOOTPIN_SW2_GPIO, BOARD_INITBOOTPIN_SW2_PIN, &SW2_config);

    /* PORTD1 (pin 64) is configured as PTD1 */
    PORT_SetPinMux(BOARD_INITBOOTPIN_SW2_PORT, BOARD_INITBOOTPIN_SW2_PIN, kPORT_MuxAsGpio);

    PORTD->PCR[1] = ((PORTD->PCR[1] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_SRE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp)

                     /* Slew Rate Enable: Slow slew rate is configured on the corresponding pin, if the pin is
                      * configured as a digital output. */
                     | PORT_PCR_SRE(kPORT_SlowSlewRate));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
UART2_PollForActivity:
- options: {callFromInitBoot: 'false', coreID: core0, enableClock: 'false'}
- pin_list:
  - {pin_num: '6', peripheral: GPIOI, signal: 'GPIO, 6', pin_signal: LCD_P46/PTI6/UART2_RX, identifier: RX_GPIO, direction: INPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : UART2_PollForActivity
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void UART2_PollForActivity(void)
{

    gpio_pin_config_t RX_GPIO_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTI6 (pin 6)  */
    GPIO_PinInit(UART2_POLLFORACTIVITY_RX_GPIO_GPIO, UART2_POLLFORACTIVITY_RX_GPIO_PIN, &RX_GPIO_config);

    /* PORTI6 (pin 6) is configured as PTI6 */
    PORT_SetPinMux(UART2_POLLFORACTIVITY_RX_GPIO_PORT, UART2_POLLFORACTIVITY_RX_GPIO_PIN, kPORT_MuxAsGpio);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
UART2_InitPins:
- options: {callFromInitBoot: 'false', prefix: UART2_, coreID: core0, enableClock: 'false'}
- pin_list:
  - {pin_num: '6', peripheral: UART2, signal: RX, pin_signal: LCD_P46/PTI6/UART2_RX, identifier: RX}
  - {pin_num: '7', peripheral: UART2, signal: TX, pin_signal: LCD_P47/PTI7/UART2_TX, identifier: TX}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : UART2_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void UART2_InitPins(void)
{

    /* PORTI6 (pin 6) is configured as UART2_RX */
    PORT_SetPinMux(UART2_RX_PORT, UART2_RX_PIN, kPORT_MuxAlt2);

    /* PORTI7 (pin 7) is configured as UART2_TX */
    PORT_SetPinMux(UART2_TX_PORT, UART2_TX_PIN, kPORT_MuxAlt2);

    SIM->MISC_CTL = ((SIM->MISC_CTL &
                      /* Mask bits to zero which are setting */
                      (~(SIM_MISC_CTL_UART2IRSEL_MASK)))

                     /* UART2 IrDA Select: Pad RX input PTI[6] or PTE[6] selected for RX input of UART2 and UART2
                      * TX signal is not used for modulation. */
                     | SIM_MISC_CTL_UART2IRSEL(MISC_CTL_UART2IRSEL_0b0));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
UART2_RestoreDefault:
- options: {callFromInitBoot: 'false', coreID: core0, enableClock: 'false'}
- pin_list:
  - {pin_num: '6', peripheral: LCD, signal: 'P, 46', pin_signal: LCD_P46/PTI6/UART2_RX, identifier: RX}
  - {pin_num: '7', peripheral: LCD, signal: 'P, 47', pin_signal: LCD_P47/PTI7/UART2_TX, identifier: TX}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : UART2_RestoreDefault
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void UART2_RestoreDefault(void)
{

    /* PORTI6 (pin 6) is configured as LCD_P46 */
    PORT_SetPinMux(UART2_RESTOREDEFAULT_RX_PORT, UART2_RESTOREDEFAULT_RX_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTI7 (pin 7) is configured as LCD_P47 */
    PORT_SetPinMux(UART2_RESTOREDEFAULT_TX_PORT, UART2_RESTOREDEFAULT_TX_PIN, kPORT_PinDisabledOrAnalog);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
I2C0_InitPins:
- options: {callFromInitBoot: 'false', prefix: I2C0_, coreID: core0, enableClock: 'false'}
- pin_list:
  - {pin_num: '105', peripheral: I2C0, signal: SCL, pin_signal: LCD_P52/PTK7/I2C0_SCL/XBAR_OUT9}
  - {pin_num: '106', peripheral: I2C0, signal: SDA, pin_signal: LCD_P53/PTL0/I2C0_SDA}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : I2C0_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void I2C0_InitPins(void)
{

    /* PORTK7 (pin 105) is configured as I2C0_SCL */
    PORT_SetPinMux(I2C0_SCL_PORT, I2C0_SCL_PIN, kPORT_MuxAlt2);

    /* PORTL0 (pin 106) is configured as I2C0_SDA */
    PORT_SetPinMux(I2C0_SDA_PORT, I2C0_SDA_PIN, kPORT_MuxAlt2);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
I2C0_RestoreDefault:
- options: {callFromInitBoot: 'false', coreID: core0, enableClock: 'false'}
- pin_list:
  - {pin_num: '105', peripheral: LCD, signal: 'P, 52', pin_signal: LCD_P52/PTK7/I2C0_SCL/XBAR_OUT9}
  - {pin_num: '106', peripheral: LCD, signal: 'P, 53', pin_signal: LCD_P53/PTL0/I2C0_SDA}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : I2C0_RestoreDefault
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void I2C0_RestoreDefault(void)
{

    /* PORTK7 (pin 105) is configured as LCD_P52 */
    PORT_SetPinMux(I2C0_RESTOREDEFAULT_SCL_PORT, I2C0_RESTOREDEFAULT_SCL_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTL0 (pin 106) is configured as LCD_P53 */
    PORT_SetPinMux(I2C0_RESTOREDEFAULT_SDA_PORT, I2C0_RESTOREDEFAULT_SDA_PIN, kPORT_PinDisabledOrAnalog);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
SPI1_InitPins:
- options: {callFromInitBoot: 'false', prefix: SPI1_, coreID: core0, enableClock: 'false'}
- pin_list:
  - {pin_num: '100', peripheral: SPI1, signal: PCS0, pin_signal: LCD_P2/PTF3/LLWU_P20/SPI1_PCS0/LPTMR0_ALT2/UART0_RX}
  - {pin_num: '101', peripheral: SPI1, signal: SCK, pin_signal: LCD_P3/PTF4/SPI1_SCK/LPTMR0_ALT1/UART0_TX}
  - {pin_num: '102', peripheral: SPI1, signal: MISO, pin_signal: LCD_P4/PTF5/SPI1_MISO/I2C1_SCL}
  - {pin_num: '103', peripheral: SPI1, signal: MOSI, pin_signal: LCD_P5/PTF6/LLWU_P3/SPI1_MOSI/I2C1_SDA}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : SPI1_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void SPI1_InitPins(void)
{

    /* PORTF3 (pin 100) is configured as SPI1_PCS0 */
    PORT_SetPinMux(SPI1_PCS_PORT, SPI1_PCS_PIN, kPORT_MuxAlt2);

    /* PORTF4 (pin 101) is configured as SPI1_SCK */
    PORT_SetPinMux(SPI1_SCK_PORT, SPI1_SCK_PIN, kPORT_MuxAlt2);

    /* PORTF5 (pin 102) is configured as SPI1_MISO */
    PORT_SetPinMux(SPI1_MISO_PORT, SPI1_MISO_PIN, kPORT_MuxAlt2);

    /* PORTF6 (pin 103) is configured as SPI1_MOSI */
    PORT_SetPinMux(SPI1_MOSI_PORT, SPI1_MOSI_PIN, kPORT_MuxAlt2);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
SPI1_RestoreDefault:
- options: {callFromInitBoot: 'false', coreID: core0, enableClock: 'false'}
- pin_list:
  - {pin_num: '100', peripheral: LCD, signal: 'P, 2', pin_signal: LCD_P2/PTF3/LLWU_P20/SPI1_PCS0/LPTMR0_ALT2/UART0_RX}
  - {pin_num: '101', peripheral: LCD, signal: 'P, 3', pin_signal: LCD_P3/PTF4/SPI1_SCK/LPTMR0_ALT1/UART0_TX}
  - {pin_num: '102', peripheral: LCD, signal: 'P, 4', pin_signal: LCD_P4/PTF5/SPI1_MISO/I2C1_SCL}
  - {pin_num: '103', peripheral: LCD, signal: 'P, 5', pin_signal: LCD_P5/PTF6/LLWU_P3/SPI1_MOSI/I2C1_SDA}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : SPI1_RestoreDefault
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void SPI1_RestoreDefault(void)
{

    /* PORTF3 (pin 100) is configured as LCD_P2 */
    PORT_SetPinMux(SPI1_RESTOREDEFAULT_PCS_PORT, SPI1_RESTOREDEFAULT_PCS_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTF4 (pin 101) is configured as LCD_P3 */
    PORT_SetPinMux(SPI1_RESTOREDEFAULT_SCK_PORT, SPI1_RESTOREDEFAULT_SCK_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTF5 (pin 102) is configured as LCD_P4 */
    PORT_SetPinMux(SPI1_RESTOREDEFAULT_MISO_PORT, SPI1_RESTOREDEFAULT_MISO_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTF6 (pin 103) is configured as LCD_P5 */
    PORT_SetPinMux(SPI1_RESTOREDEFAULT_MOSI_PORT, SPI1_RESTOREDEFAULT_MOSI_PIN, kPORT_PinDisabledOrAnalog);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
